espressif/esp-idf/components/soc/esp32h4/register/soc/mcpwm_struct.h
/**
 * SPDX-FileCopyrightText: 2025 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0 OR MIT
 */
#pragma once

#include <stdint.h>
#ifdef __cplusplus
extern "C" {
#endif

/** Group: Configuration register */
/** Type of timern_cfg0 register
 *  PWM timern period and update method configuration register.
 */
typedef union {
    struct {
        /** timern_prescale : R/W; bitpos: [7:0]; default: 0;
         *  Configures the prescaler value of timern, so that the period of PT0_clk = Period of
         *  PWM_clk * (PWM_TIMERn_PRESCALE + 1)
         */
        uint32_t timern_prescale:8;
        /** timern_period : R/W; bitpos: [23:8]; default: 255;
         *  Configures the period shadow of PWM timern
         */
        uint32_t timern_period:16;
        /** timern_period_upmethod : R/W; bitpos: [25:24]; default: 0;
         *  Configures the update method for active register of PWM timern period.
         *  0: Immediate
         *  1: TEZ
         *  2: Sync
         *  3: TEZ or sync
         *  TEZ here and below means timer equal zero event
         */
        uint32_t timern_period_upmethod:2;
        uint32_t reserved_26:6;
    };
    uint32_t val;
} mcpwm_timern_cfg0_reg_t;

/** Type of timern_cfg1 register
 *  PWM timern working mode and start/stop control register.
 */
typedef union {
    struct {
        /** timern_start : R/W/SC; bitpos: [2:0]; default: 0;
         *  Configures whether or not to start/stop PWM timern.
         *  0: If PWM timern starts, then stops at TEZ
         *  1: If timern starts, then stops at TEP
         *  2: PWM timern starts and runs on
         *  3: Timern starts and stops at the next TEZ
         *  4: Timer0 starts and stops at the next TEP.
         *  TEP here and below means the event that happens when the timer equals to period
         */
        uint32_t timern_start:3;
        /** timern_mod : R/W; bitpos: [4:3]; default: 0;
         *  Configures the working mode of PWM timern.
         *  0: Freeze
         *  1: Increase mode
         *  2: Decrease mode
         *  3: Up-down mode
         */
        uint32_t timern_mod:2;
        uint32_t reserved_5:27;
    };
    uint32_t val;
} mcpwm_timern_cfg1_reg_t;

/** Type of timern_sync register
 *  PWM timern sync function configuration register.
 */
typedef union {
    struct {
        /** timern_synci_en : R/W; bitpos: [0]; default: 0;
         *  Configures whether or not to enable timern reloading with phase on sync input event
         *  is enabled.
         *  0: Disable
         *  1: Enable
         */
        uint32_t timern_synci_en:1;
        /** timern_sync_sw : R/W; bitpos: [1]; default: 0;
         *  Configures the generation of software sync. Toggling this bit will trigger a
         *  software sync.
         */
        uint32_t timern_sync_sw:1;
        /** timern_synco_sel : R/W; bitpos: [3:2]; default: 0;
         *  Configures the selection of PWM timern sync_out.
         *  0: Sync_in
         *  1: TEZ
         *  2: TEP
         *  3: Invalid, sync_out selects noting
         */
        uint32_t timern_synco_sel:2;
        /** timern_phase : R/W; bitpos: [19:4]; default: 0;
         *  Configures the phase for timern reload on sync event.
         */
        uint32_t timern_phase:16;
        /** timern_phase_direction : R/W; bitpos: [20]; default: 0;
         *  Configures the PWM timern's direction when timern mode is up-down mode.
         *  0: Increase
         *  1: Decrease
         */
        uint32_t timern_phase_direction:1;
        uint32_t reserved_21:11;
    };
    uint32_t val;
} mcpwm_timern_sync_reg_t;

/** Type of timer_synci_cfg register
 *  Synchronization input selection register for PWM timers.
 */
typedef union {
    struct {
        /** timer0_syncisel : R/W; bitpos: [2:0]; default: 0;
         *  Configures the selection of sync input for PWM timer0.
         *  1: PWM timer0 sync_out
         *  2: PWM timer1 sync_out
         *  3: PWM timer2 sync_out
         *  4: SYNC0 from GPIO matrix
         *  5: SYNC1 from GPIO matrix
         *  6: SYNC2 from GPIO matrix
         *  Other values: No sync input selected
         */
        uint32_t timer0_syncisel:3;
        /** timer1_syncisel : R/W; bitpos: [5:3]; default: 0;
         *  Configures the selection of sync input for PWM timer1.
         *  1: PWM timer0 sync_out
         *  2: PWM timer1 sync_out
         *  3: PWM timer2 sync_out
         *  4: SYNC0 from GPIO matrix
         *  5: SYNC1 from GPIO matrix
         *  6: SYNC2 from GPIO matrix
         *  Other values: No sync input selected
         */
        uint32_t timer1_syncisel:3;
        /** timer2_syncisel : R/W; bitpos: [8:6]; default: 0;
         *  Configures the selection of sync input for PWM timer2.
         *  1: PWM timer0 sync_out
         *  2: PWM timer1 sync_out
         *  3: PWM timer2 sync_out
         *  4: SYNC0 from GPIO matrix
         *  5: SYNC1 from GPIO matrix
         *  6: SYNC2 from GPIO matrix
         *  Other values: No sync input selected
         */
        uint32_t timer2_syncisel:3;
        /** external_synci0_invert : R/W; bitpos: [9]; default: 0;
         *  Configures whether or not to invert SYNC0 from GPIO matrix.
         *  0: Not invert
         *  1: Invert
         */
        uint32_t external_synci0_invert:1;
        /** external_synci1_invert : R/W; bitpos: [10]; default: 0;
         *  Configures whether or not to invert SYNC1 from GPIO matrix.
         *  0: Not invert
         *  1: Invert
         */
        uint32_t external_synci1_invert:1;
        /** external_synci2_invert : R/W; bitpos: [11]; default: 0;
         *  Configures whether or not to invert SYNC2 from GPIO matrix.
         *  0: Not invert
         *  1: Invert
         */
        uint32_t external_synci2_invert:1;
        uint32_t reserved_12:20;
    };
    uint32_t val;
} mcpwm_timer_synci_cfg_reg_t;

/** Type of operator_timersel register
 *  PWM operator's timer select register
 */
typedef union {
    struct {
        /** operator0_timersel : R/W; bitpos: [1:0]; default: 0;
         *  Configures which PWM timer will be the timing reference for PWM operator0.
         *  0: Timer0
         *  1: Timer1
         *  2: Timer2
         *  3: Invalid, will select timer2
         */
        uint32_t operator0_timersel:2;
        /** operator1_timersel : R/W; bitpos: [3:2]; default: 0;
         *  Configures which PWM timer will be the timing reference for PWM operator1.
         *  0: Timer0
         *  1: Timer1
         *  2: Timer2
         *  3: Invalid, will select timer2
         */
        uint32_t operator1_timersel:2;
        /** operator2_timersel : R/W; bitpos: [5:4]; default: 0;
         *  Configures which PWM timer will be the timing reference for PWM operator2.
         *  0: Timer0
         *  1: Timer1
         *  2: Timer2
         *  3: Invalid, will select timer2
         */
        uint32_t operator2_timersel:2;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} mcpwm_operator_timersel_reg_t;

/** Type of genn_stmp_cfg register
 *  Generatorn time stamp registers A and B transfer status and update method register
 */
typedef union {
    struct {
        /** cmprn_a_upmethod : R/W; bitpos: [3:0]; default: 0;
         *  Configures the update method for PWM generator n time stamp A's active register.
         *  0: Immediately
         *  Bit0 is set to 1: TEZ
         *  Bit1 is set to 1: TEP
         *  Bit2 is set to 1: Sync
         *  Bit3 is set to 1: Disable the update
         */
        uint32_t cmprn_a_upmethod:4;
        /** cmprn_b_upmethod : R/W; bitpos: [7:4]; default: 0;
         *  Configures the update method for PWM generator n time stamp B's active register.
         *  0: Immediately
         *  Bit0 is set to 1: TEZ
         *  Bit1 is set to 1: TEP
         *  Bit2 is set to 1: Sync
         *  Bit3 is set to 1: Disable the update
         */
        uint32_t cmprn_b_upmethod:4;
        /** cmprn_a_shdw_full : R/W/WTC/SC; bitpos: [8]; default: 0;
         *  Represents whether or not generatorn time stamp A's shadow reg is transferred.
         *  0: A's active reg has been updated with shadow register latest value.
         *  1: A's shadow reg is filled and waiting to be transferred to A's active reg
         */
        uint32_t cmprn_a_shdw_full:1;
        /** cmprn_b_shdw_full : R/W/WTC/SC; bitpos: [9]; default: 0;
         *  Represents whether or not generatorn time stamp B's shadow reg is transferred.
         *  0: B's active reg has been updated with shadow register latest value.
         *  1: B's shadow reg is filled and waiting to be transferred to B's active reg
         */
        uint32_t cmprn_b_shdw_full:1;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} mcpwm_genn_stmp_cfg_reg_t;

/** Type of genn_tstmp register
 *  Generatorn time stamp shadow register (unified type for array access)
 */
typedef union {
    struct {
        /** cmprn : R/W; bitpos: [15:0]; default: 0;
         *  Configures the value of PWM generator n time stamp shadow register.
         */
        uint32_t cmprn:16;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} mcpwm_genn_tstmp_reg_t;

/** Type of genn_cfg0 register
 *  Generatorn fault event T0 and T1 configuration register
 */
typedef union {
    struct {
        /** genn_cfg_upmethod : R/W; bitpos: [3:0]; default: 0;
         *  Configures update method for PWM generator n's active register.
         *  0: Immediately
         *  Bit0 is set to 1: TEZ
         *  Bit1 is set to 1: TEP
         *  Bit2 is set to 1: Sync
         *  Bit3 is set to 1: Disable the update
         */
        uint32_t genn_cfg_upmethod:4;
        /** genn_t0_sel : R/W; bitpos: [6:4]; default: 0;
         *  Configures source selection for PWM generator n event_t0, take effect immediately.
         *  0: fault_event0
         *  1: fault_event1
         *  2: fault_event2
         *  3: sync_taken
         *  4: Invalid, Select nothing
         */
        uint32_t genn_t0_sel:3;
        /** genn_t1_sel : R/W; bitpos: [9:7]; default: 0;
         *  Configures source selection for PWM generator n event_t1, take effect immediately.
         *  0: fault_event0
         *  1: fault_event1
         *  2: fault_event2
         *  3: sync_taken
         *  4: Invalid, Select nothing
         */
        uint32_t genn_t1_sel:3;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} mcpwm_genn_cfg0_reg_t;

/** Type of genn_force register
 *  Generatorn output signal force mode register.
 */
typedef union {
    struct {
        /** genn_cntuforce_upmethod : R/W; bitpos: [5:0]; default: 32;
         *  Configures update method for continuous software force of PWM generatorn.
         *  0: Immediately
         *  Bit0 is set to 1: TEZ
         *  Bit1 is set to 1: TEP
         *  Bit2 is set to 1: TEA
         *  Bit3 is set to 1: TEB
         *  Bit4 is set to 1: Sync
         *  Bit5 is set to 1: Disable update. TEA/B here and below means an event generated
         *  when the timer's value equals to that of register A/B.
         */
        uint32_t genn_cntuforce_upmethod:6;
        /** genn_a_cntuforce_mode : R/W; bitpos: [7:6]; default: 0;
         *  Configures continuous software force mode for PWMn A.
         *  0: Disabled
         *  1: Low
         *  2: High
         *  3: Disabled
         */
        uint32_t genn_a_cntuforce_mode:2;
        /** genn_b_cntuforce_mode : R/W; bitpos: [9:8]; default: 0;
         *  Configures continuous software force mode for PWMn B.
         *  0: Disabled
         *  1: Low
         *  2: High
         *  3: Disabled
         */
        uint32_t genn_b_cntuforce_mode:2;
        /** genn_a_nciforce : R/W; bitpos: [10]; default: 0;
         *  Configures the generation of non-continuous immediate software-force event for PWMn
         *  A, a toggle will trigger a force event.
         */
        uint32_t genn_a_nciforce:1;
        /** genn_a_nciforce_mode : R/W; bitpos: [12:11]; default: 0;
         *  Configures non-continuous immediate software force mode for PWMn A.
         *  0: Disabled
         *  1: Low
         *  2: High
         *  3: Disabled
         */
        uint32_t genn_a_nciforce_mode:2;
        /** genn_b_nciforce : R/W; bitpos: [13]; default: 0;
         *  Configures the generation of non-continuous immediate software-force event for PWMn
         *  B, a toggle will trigger a force event.
         */
        uint32_t genn_b_nciforce:1;
        /** genn_b_nciforce_mode : R/W; bitpos: [15:14]; default: 0;
         *  Configures non-continuous immediate software force mode for PWMn B.
         *  0: Disabled
         *  1: Low
         *  2: High
         *  3: Disabled
         */
        uint32_t genn_b_nciforce_mode:2;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} mcpwm_genn_force_reg_t;


/** Type of genn register
 *  PWMn output signal actions configuration register (unified type for array access)
 */
typedef union {
    struct {
        /** genn_utez : R/W; bitpos: [1:0]; default: 0;
         *  Configures action on PWMn triggered by event TEZ when timer increasing.
         *  0: No change, 1: Low, 2: High, 3: Toggle
         */
        uint32_t genn_utez:2;
        /** genn_utep : R/W; bitpos: [3:2]; default: 0;
         *  Configures action on PWMn triggered by event TEP when timer increasing.
         *  0: No change, 1: Low, 2: High, 3: Toggle
         */
        uint32_t genn_utep:2;
        /** genn_utea : R/W; bitpos: [5:4]; default: 0;
         *  Configures action on PWMn triggered by event TEA when timer increasing.
         *  0: No change, 1: Low, 2: High, 3: Toggle
         */
        uint32_t genn_utea:2;
        /** genn_uteb : R/W; bitpos: [7:6]; default: 0;
         *  Configures action on PWMn triggered by event TEB when timer increasing.
         *  0: No change, 1: Low, 2: High, 3: Toggle
         */
        uint32_t genn_uteb:2;
        /** genn_ut0 : R/W; bitpos: [9:8]; default: 0;
         *  Configures action on PWMn triggered by event_t0 when timer increasing.
         *  0: No change, 1: Low, 2: High, 3: Toggle
         */
        uint32_t genn_ut0:2;
        /** genn_ut1 : R/W; bitpos: [11:10]; default: 0;
         *  Configures action on PWMn triggered by event_t1 when timer increasing.
         *  0: No change, 1: Low, 2: High, 3: Toggle
         */
        uint32_t genn_ut1:2;
        /** genn_dtez : R/W; bitpos: [13:12]; default: 0;
         *  Configures action on PWMn triggered by event TEZ when timer decreasing.
         *  0: No change, 1: Low, 2: High, 3: Toggle
         */
        uint32_t genn_dtez:2;
        /** genn_dtep : R/W; bitpos: [15:14]; default: 0;
         *  Configures action on PWMn triggered by event TEP when timer decreasing.
         *  0: No change, 1: Low, 2: High, 3: Toggle
         */
        uint32_t genn_dtep:2;
        /** genn_dtea : R/W; bitpos: [17:16]; default: 0;
         *  Configures action on PWMn triggered by event TEA when timer decreasing.
         *  0: No change, 1: Low, 2: High, 3: Toggle
         */
        uint32_t genn_dtea:2;
        /** genn_dteb : R/W; bitpos: [19:18]; default: 0;
         *  Configures action on PWMn triggered by event TEB when timer decreasing.
         *  0: No change, 1: Low, 2: High, 3: Toggle
         */
        uint32_t genn_dteb:2;
        /** genn_dt0 : R/W; bitpos: [21:20]; default: 0;
         *  Configures action on PWMn triggered by event_t0 when timer decreasing.
         *  0: No change, 1: Low, 2: High, 3: Toggle
         */
        uint32_t genn_dt0:2;
        /** genn_dt1 : R/W; bitpos: [23:22]; default: 0;
         *  Configures action on PWMn triggered by event_t1 when timer decreasing.
         *  0: No change, 1: Low, 2: High, 3: Toggle
         */
        uint32_t genn_dt1:2;
        uint32_t reserved_24:8;
    };
    uint32_t val;
} mcpwm_genn_reg_t;

/** Type of opn_tstmp register
 *  Operator timestamp register (unified type for array access)
 */
typedef union {
    struct {
        /** opn_tstmp_e : R/W; bitpos: [15:0]; default: 0;
         *  Configures the value of PWM operator timestamp.
         */
        uint32_t opn_tstmp_e:16;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} mcpwm_opn_tstmp_reg_t;

/** Type of dtn_cfg register
 *  Dead time configuration register
 */
typedef union {
    struct {
        /** dbn_fed_upmethod : R/W; bitpos: [3:0]; default: 0;
         *  Configures update method for FED (Falling edge delay) active register.
         *  0: Immediate
         *  Bit0 is set to 1: TEZ
         *  Bit1 is set to 1: TEP
         *  Bit2 is set to 1: Sync
         *  Bit3 is set to 1: Disable the update
         */
        uint32_t dbn_fed_upmethod:4;
        /** dbn_red_upmethod : R/W; bitpos: [7:4]; default: 0;
         *  Configures update method for RED (rising edge delay) active register.
         *  0: Immediate
         *  Bit0 is set to 1: TEZ
         *  Bit1 is set to 1: TEP
         *  Bit2 is set to 1: Sync
         *  Bit3 is set to 1: Disable the update
         */
        uint32_t dbn_red_upmethod:4;
        /** dbn_deb_mode : R/W; bitpos: [8]; default: 0;
         *  Configures S8 in table, dual-edge B mode.
         *  0: fed/red take effect on different path separately
         *  1: fed/red take effect on B path, A out is in bypass or dulpB mode
         */
        uint32_t dbn_deb_mode:1;
        /** dbn_a_outswap : R/W; bitpos: [9]; default: 0;
         *  Configures S6 in table.
         */
        uint32_t dbn_a_outswap:1;
        /** dbn_b_outswap : R/W; bitpos: [10]; default: 0;
         *  Configures S7 in table.
         */
        uint32_t dbn_b_outswap:1;
        /** dbn_red_insel : R/W; bitpos: [11]; default: 0;
         *  Configures S4 in table.
         */
        uint32_t dbn_red_insel:1;
        /** dbn_fed_insel : R/W; bitpos: [12]; default: 0;
         *  Configures S5 in table.
         */
        uint32_t dbn_fed_insel:1;
        /** dbn_red_outinvert : R/W; bitpos: [13]; default: 0;
         *  Configures S2 in table.
         */
        uint32_t dbn_red_outinvert:1;
        /** dbn_fed_outinvert : R/W; bitpos: [14]; default: 0;
         *  Configures S3 in table.
         */
        uint32_t dbn_fed_outinvert:1;
        /** dbn_a_outbypass : R/W; bitpos: [15]; default: 1;
         *  Configures S1 in table.
         */
        uint32_t dbn_a_outbypass:1;
        /** dbn_b_outbypass : R/W; bitpos: [16]; default: 1;
         *  Configures S0 in table.
         */
        uint32_t dbn_b_outbypass:1;
        /** dbn_clk_sel : R/W; bitpos: [17]; default: 0;
         *  Configures dead time generator n clock selection.
         *  0: PWM_clk
         *  1: PT_clk
         */
        uint32_t dbn_clk_sel:1;
        uint32_t reserved_18:14;
    };
    uint32_t val;
} mcpwm_dtn_cfg_reg_t;

/** Type of dtn_fed_cfg register
 *  Falling edge delay (FED) shadow register
 */
typedef union {
    struct {
        /** dbn_fed : R/W; bitpos: [15:0]; default: 0;
         *  Configures shadow register for FED.
         */
        uint32_t dbn_fed:16;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} mcpwm_dtn_fed_cfg_reg_t;

/** Type of dtn_red_cfg register
 *  Rising edge delay (RED) shadow register
 */
typedef union {
    struct {
        /** dbn_red : R/W; bitpos: [15:0]; default: 0;
         *  Configures shadow register for RED.
         */
        uint32_t dbn_red:16;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} mcpwm_dtn_red_cfg_reg_t;

/** Type of carriern_cfg register
 *  Carriern configuration register
 */
typedef union {
    struct {
        /** choppern_en : R/W; bitpos: [0]; default: 0;
         *  Configures whether or not to enable carriern.
         *  0: Bypassed
         *  1: Enabled
         */
        uint32_t choppern_en:1;
        /** choppern_prescale : R/W; bitpos: [4:1]; default: 0;
         *  Configures the prescale value of PWM carriern clock (PC_clk), so that period of
         *  PC_clk = period of PWM_clk * (PWM_CARRIERn_PRESCALE + 1)
         */
        uint32_t choppern_prescale:4;
        /** choppern_duty : R/W; bitpos: [7:5]; default: 0;
         *  Configures carrier duty. Duty = PWM_CARRIERn_DUTY / 8
         */
        uint32_t choppern_duty:3;
        /** choppern_oshtwth : R/W; bitpos: [11:8]; default: 0;
         *  Configures width of the first pulse. Measurement unit: Periods of the carrier.
         */
        uint32_t choppern_oshtwth:4;
        /** choppern_out_invert : R/W; bitpos: [12]; default: 0;
         *  Configures whether or not to invert the output of PWMn A and PWMn B for this
         *  submodule.
         *  0: Normal
         *  1: Invert
         */
        uint32_t choppern_out_invert:1;
        /** choppern_in_invert : R/W; bitpos: [13]; default: 0;
         *  Configures whether or not to invert the input of PWMn A and PWMn B for this
         *  submodule.
         *  0: Normal
         *  1: Invert
         */
        uint32_t choppern_in_invert:1;
        uint32_t reserved_14:18;
    };
    uint32_t val;
} mcpwm_carriern_cfg_reg_t;

